/*20. Да се състави програма, която съхранява в 
масив следните данни за книгите в една библиотека:
- инвентарен номер - низ до 6 знака;
- автор - низ от 20 знака;
- заглавие - низ до 30 знака;
- обем на книгата (брой страници) - цяло число;
- цена - реално число;
- година на издаване
и извършва следните операции:
- създава масива с данните за книгите;
- извежда на екрана данните за всички книги;
- намира и извежда сумата от цените на всички
книги над 100 стр., издадени след 2000г;
- създава нов масив с данните на всички книги 
от зададен автор с обем над 200 стр.*/

#include <iostream>
#include <ctime>
#include <string>
#include <vector>
using namespace std;

class Library {
public:

};
