/*Даден е низ съставен от големи и малки латински 
букви и цифри с дължина N. 
Напишете програма, която определя дали в него
има знак (буква или цифра която се среща поне 
2 пъти). Ако такъв знак няма, програмата 
да извежда думата NO, а ако има програмата 
да извежда две числа между 1 и N - позициите
в низа в които са намерени срещания на един и
същ знак.*/

#include <iostream> 
#include <cstring>
using namespace std;

int main()
{
	char N[1000];
	cout << "Write a string: ";
	cin >> N;

	for (int i = 0; i < strlen(N); i++)
	{
		for (int j = i + 1; j < strlen(N); j++)
		{
			if (N[i] == N[j])
			{
				cout << i + 1 << " " << j + 1;
				return 0;
			}
		}
	}
	cout << "No";
}
